    /*
    1. 2의 n승을 구하는 함수를 재귀적으로 구현해 보자.
    그리고 그에 따른 적절한 함수를 구현해 보자.
    참고로 재귀 함수의 구현이 처음에는 어려운 편이기 때문에 여기서는 쉬운 문제를 제시하였다

    2. 프로그램 사용자로부터 초(second)를 입력받은 후에,
    이를 [시, 분, 초]의 형태로 출력하는 프로그램을 작성해 보자.

    3. 필자가 좋아하는 것 중 하나가 금요일 저녁 퇴근길에 DVD나 만화책을 잔뜩 빌리고,
    동네 슈퍼에 들러서 군것질거리를 사 가지고 집에 들어가는 것이다.
    오늘은 금요일이다. 현재 필자의 주머니에는 5천 원이 있다.
    DVD 한 편을 빌리면 3,500원이 남는다.
    슈퍼에 들려서 크림빵(500원), 새우깡(700원), 콜라(400원)를 사려한다.
    잔돈을 하나도 남기지 않고 이 세 가지 물건을 하나 이상 반드시 구매하려면
    어떻게 구매를 진행해야 하겠는가? 물론 여기에는 여러 가지 경우의 수가 있을 것이다.

    필자가 어떠한 선택을 할 수 있는지 여러분이 제시해 주기 바란다.

    4. 두 개의 정수를 입력받아서 최대 공약수(GCD)를 구하는 프로그램을 작성해 보자.

    5. 방정식의 모든 해를 구하시오(단, 와는 정수이고 각각의 범위는 2x+4y=10, x y
    0<=x<=10, 0<=y<=10


    7/10 새 과제

    2. 피보나치 수열 은 앞을 두 수를 더해서 다음 수를 만들어 나가는 수열이다

    예를 들어 앞의 두 수가 1과 1이라면 그 다음 수는 2가 되고 그 다음 수는 1과 2를 더해서 3이 된다.
    1,1,2,3,5,8,13,21,... 이렇게 진행된다
    피보나치수열의 10 번째 수는 무엇인지 계산하는 프로그램을 완성하시오

    3. 구구단의 일부분을 다음과 같이 출력하시오
    2*1=2       3*1=3       4*1=4
    2*2=4       3*2=6       4*2=8
    2*3=6       3*3=9       4*3=12

    5*1=5       6*1=6       7*1=7
    5*2=10      6*2=12      7*2=14
    5*3=15      6*3=18      7*3=21

    8*1=8       9*1=9
    8*2=16      9*2=18
    8*3=24      9*3=27

    */
